99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
#include "esp32_mquickjs_spi.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_SPI

#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_memory_utils.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"

#define ESP32_MQUICKJS_SPI_DEFAULT_HOST_NUMBER \
    esp32_mquickjs_profile_int_or("ESP32QJS_SPI_HOST", 2)
#define ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT (SPI_HOST_MAX - SPI2_HOST)
#define ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT \
    (ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT * ESP32_MQUICKJS_SPI_MAX_DEVICES_PER_BUS)

typedef struct {
    int32_t slot_id;
    uint32_t generation;
} esp32_mquickjs_spi_bus_ref_t;

typedef struct {
    int32_t slot_id;
    uint32_t generation;
} esp32_mquickjs_spi_device_ref_t;

typedef struct {
    bool allocated;
    int32_t slot_id;
    uint32_t generation;
    int32_t host_number;
    spi_host_device_t host_id;
    int32_t sclk_pin;
    int32_t mosi_pin;
    int32_t miso_pin;
    uint32_t max_transfer_size;
    uint32_t open_devices;
} esp32_mquickjs_spi_bus_slot_t;

typedef struct {
    bool allocated;
    int32_t slot_id;
    uint32_t generation;
    int32_t parent_bus_slot_id;
    uint32_t parent_bus_generation;
    int32_t cs_pin;
    uint8_t mode;
    uint32_t freq_hz;
    uint32_t queue_size;
    bool cs_high;
    bool lsb_first;
    bool busy;
    spi_device_handle_t handle;
    uint8_t *tx_dma_buffers[2];
    size_t tx_dma_capacities[2];
} esp32_mquickjs_spi_device_slot_t;

static esp32_mquickjs_spi_bus_slot_t s_spi_bus_slots[ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT];
static esp32_mquickjs_spi_device_slot_t s_spi_device_slots[ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT];
static uint32_t s_spi_next_generation = 1;

static bool spi_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime);

static esp_err_t spi_queue_transaction_cooperatively(spi_device_handle_t handle,
                                                     spi_transaction_t *transaction);
static esp_err_t spi_wait_queued_write(spi_device_handle_t handle,
                                       uint64_t *wait_us);

static bool js_value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return false;
    }
    *out_value = (uint32_t)raw_value;
    return true;
}

static bool js_value_to_bool(JSContext *ctx, JSValue value, bool *out_value)
{
    int raw_value = 0;

    if (JS_IsBool(value)) {
        *out_value = (value == JS_TRUE);
        return true;
    }
    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = raw_value != 0;
    return true;
}

static bool js_value_to_gpio_num(JSContext *ctx, JSValue value, int32_t *out_pin, bool allow_negative_one)
{
    int pin = -1;

    if (JS_ToInt32(ctx, &pin, value) != 0) {
        return false;
    }
    if (allow_negative_one && pin == -1) {
        *out_pin = -1;
        return true;
    }
    if (pin < 0 || pin >= GPIO_NUM_MAX || !GPIO_IS_VALID_GPIO(pin)) {
        return false;
    }

    *out_pin = pin;
    return true;
}

static bool js_value_to_spi_host_number(JSContext *ctx, JSValue value, int32_t *out_host_number)
{
    uint32_t host_number = 0;

    if (!js_value_to_u32(ctx, value, &host_number)) {
        return false;
    }
    if (host_number == 2U) {
        *out_host_number = 2;
        return true;
    }
#if SOC_SPI_PERIPH_NUM > 2
    if (host_number == 3U) {
        *out_host_number = 3;
        return true;
    }
#endif
    return false;
}

static bool js_value_to_spi_mode(JSContext *ctx, JSValue value, uint8_t *out_mode)
{
    uint32_t mode = 0;

    if (!js_value_to_u32(ctx, value, &mode) || mode > 3U) {
        return false;
    }
    *out_mode = (uint8_t)mode;
    return true;
}

static JSValue spi_throw_error(JSContext *ctx, esp_err_t err, const char *message)
{
    return JS_ThrowInternalError(ctx, "%s: %s", message, esp_err_to_name(err));
}

static spi_host_device_t spi_slot_id_to_host_id(int32_t slot_id)
{
    if (slot_id <= 0) {
        return SPI2_HOST;
    }
#if SOC_SPI_PERIPH_NUM > 2
    return SPI3_HOST;
#else
    return SPI2_HOST;
#endif
}

static bool spi_host_number_to_ids(int32_t host_number,
                                   int32_t *out_slot_id,
                                   spi_host_device_t *out_host_id)
{
    if (host_number == 2) {
        if (out_slot_id != NULL) {
            *out_slot_id = 0;
        }
        if (out_host_id != NULL) {
            *out_host_id = SPI2_HOST;
        }
        return true;
    }
#if SOC_SPI_PERIPH_NUM > 2
    if (host_number == 3) {
        if (out_slot_id != NULL) {
            *out_slot_id = 1;
        }
        if (out_host_id != NULL) {
            *out_host_id = SPI3_HOST;
        }
        return true;
    }
#endif
    return false;
}

static void spi_init_bus_slot(esp32_mquickjs_spi_bus_slot_t *slot, int32_t slot_id)
{
    memset(slot, 0, sizeof(*slot));
    slot->slot_id = slot_id;
    slot->host_number = slot_id + 2;
    slot->host_id = spi_slot_id_to_host_id(slot_id);
    slot->sclk_pin = ESP32_MQUICKJS_SPI_DEFAULT_SCLK_PIN;
    slot->mosi_pin = ESP32_MQUICKJS_SPI_DEFAULT_MOSI_PIN;
    slot->miso_pin = ESP32_MQUICKJS_SPI_DEFAULT_MISO_PIN;
    slot->max_transfer_size = ESP32_MQUICKJS_SPI_DEFAULT_MAX_TRANSFER_SIZE;
}

static void spi_init_device_slot(esp32_mquickjs_spi_device_slot_t *slot, int32_t slot_id)
{
    memset(slot, 0, sizeof(*slot));
    slot->slot_id = slot_id;
    slot->parent_bus_slot_id = -1;
    slot->cs_pin = ESP32_MQUICKJS_SPI_DEFAULT_CS_PIN;
}

static void spi_reset_slots(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT; ++i) {
        spi_init_bus_slot(&s_spi_bus_slots[i], i);
    }
    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT; ++i) {
        spi_init_device_slot(&s_spi_device_slots[i], i);
    }
    s_spi_next_generation = 1;
}

static uint32_t spi_take_generation(void)
{
    uint32_t generation = s_spi_next_generation++;

    if (generation == 0) {
        generation = s_spi_next_generation++;
    }
    return generation;
}

