99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
static esp32_mquickjs_spi_bus_slot_t *spi_get_bus_slot_by_ids(int32_t slot_id, uint32_t generation)
{
    esp32_mquickjs_spi_bus_slot_t *slot;

    if (slot_id < 0 || slot_id >= (int32_t)ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT) {
        return NULL;
    }

    slot = &s_spi_bus_slots[slot_id];
    if (!slot->allocated || slot->generation != generation) {
        return NULL;
    }
    return slot;
}

static esp32_mquickjs_spi_bus_slot_t *spi_get_bus_slot(const esp32_mquickjs_spi_bus_ref_t *ref)
{
    if (ref == NULL) {
        return NULL;
    }
    return spi_get_bus_slot_by_ids(ref->slot_id, ref->generation);
}

static esp32_mquickjs_spi_device_slot_t *spi_get_device_slot(const esp32_mquickjs_spi_device_ref_t *ref)
{
    esp32_mquickjs_spi_device_slot_t *slot;

    if (ref == NULL || ref->slot_id < 0 || ref->slot_id >= (int32_t)ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT) {
        return NULL;
    }

    slot = &s_spi_device_slots[ref->slot_id];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static void spi_free_tx_dma_buffers(esp32_mquickjs_spi_device_slot_t *slot)
{
    if (slot == NULL) {
        return;
    }
    heap_caps_free(slot->tx_dma_buffers[0]);
    heap_caps_free(slot->tx_dma_buffers[1]);
    slot->tx_dma_buffers[0] = NULL;
    slot->tx_dma_buffers[1] = NULL;
    slot->tx_dma_capacities[0] = 0;
    slot->tx_dma_capacities[1] = 0;
}

static void spi_cleanup_device_slot(esp32_mquickjs_spi_device_slot_t *slot)
{
    esp32_mquickjs_spi_bus_slot_t *parent;
    int32_t slot_id;

    if (slot == NULL || !slot->allocated) {
        return;
    }

    slot_id = slot->slot_id;
    if (slot->handle != NULL) {
        spi_bus_remove_device(slot->handle);
    }
    spi_free_tx_dma_buffers(slot);
    parent = spi_get_bus_slot_by_ids(slot->parent_bus_slot_id, slot->parent_bus_generation);
    if (parent != NULL && parent->open_devices > 0) {
        parent->open_devices--;
    }
    spi_init_device_slot(slot, slot_id);
}

static void spi_cleanup_bus_slot(esp32_mquickjs_spi_bus_slot_t *slot)
{
    int32_t i;
    int32_t slot_id;

    if (slot == NULL || !slot->allocated) {
        return;
    }

    slot_id = slot->slot_id;
    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT; ++i) {
        esp32_mquickjs_spi_device_slot_t *device_slot = &s_spi_device_slots[i];

        if (!device_slot->allocated || device_slot->parent_bus_slot_id != slot->slot_id ||
            device_slot->parent_bus_generation != slot->generation) {
            continue;
        }
        spi_cleanup_device_slot(device_slot);
    }

    if (slot->sclk_pin >= 0) {
        spi_bus_free(slot->host_id);
    }
    spi_init_bus_slot(slot, slot_id);
}

static esp32_mquickjs_spi_bus_slot_t *spi_alloc_bus_slot(int32_t host_number)
{
    int32_t slot_id = -1;
    spi_host_device_t host_id = SPI2_HOST;
    esp32_mquickjs_spi_bus_slot_t *slot;

    if (!spi_host_number_to_ids(host_number, &slot_id, &host_id)) {
        return NULL;
    }

    slot = &s_spi_bus_slots[slot_id];
    if (slot->allocated) {
        return NULL;
    }

    spi_init_bus_slot(slot, slot_id);
    slot->allocated = true;
    slot->generation = spi_take_generation();
    slot->host_number = host_number;
    slot->host_id = host_id;
    return slot;
}

static esp32_mquickjs_spi_device_slot_t *spi_alloc_device_slot(esp32_mquickjs_spi_bus_slot_t *bus_slot)
{
    int32_t i;

    if (bus_slot == NULL || !bus_slot->allocated ||
        bus_slot->open_devices >= ESP32_MQUICKJS_SPI_MAX_DEVICES_PER_BUS) {
        return NULL;
    }

    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT; ++i) {
        esp32_mquickjs_spi_device_slot_t *slot = &s_spi_device_slots[i];

        if (slot->allocated) {
            continue;
        }
        spi_init_device_slot(slot, i);
        slot->allocated = true;
        slot->generation = spi_take_generation();
        slot->parent_bus_slot_id = bus_slot->slot_id;
        slot->parent_bus_generation = bus_slot->generation;
        bus_slot->open_devices++;
        return slot;
    }

    return NULL;
}

static int spi_bus_ref_from_object(JSContext *ctx,
                                   JSValue bus_value,
                                   const char *api_name,
                                   esp32_mquickjs_spi_bus_ref_t *out_ref)
{
    const esp32_mquickjs_spi_bus_ref_t *bus_ref;

    if (out_ref == NULL || JS_GetClassID(ctx, bus_value) != JS_CLASS_SPI_BUS) {
        JS_ThrowTypeError(ctx, "%s expects a valid SPIBus instance", api_name);
        return -1;
    }
    bus_ref = JS_GetOpaque(ctx, bus_value);
    if (bus_ref == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a valid SPIBus instance", api_name);
        return -1;
    }
    *out_ref = *bus_ref;
    return 0;
}

static int spi_device_ref_from_object(JSContext *ctx,
                                      JSValue device_value,
                                      const char *api_name,
                                      esp32_mquickjs_spi_device_ref_t *out_ref)
{
    const esp32_mquickjs_spi_device_ref_t *device_ref;

    if (out_ref == NULL || JS_GetClassID(ctx, device_value) != JS_CLASS_SPI_DEVICE) {
        JS_ThrowTypeError(ctx, "%s expects a valid SPIDevice instance", api_name);
        return -1;
    }
    device_ref = JS_GetOpaque(ctx, device_value);
    if (device_ref == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a valid SPIDevice instance", api_name);
        return -1;
    }
    *out_ref = *device_ref;
    return 0;
}

static int spi_get_this_bus_slot(JSContext *ctx,
                                 JSValue this_value,
                                 const char *api_name,
                                 esp32_mquickjs_spi_bus_ref_t *out_ref,
                                 esp32_mquickjs_spi_bus_slot_t **out_slot)
{
    esp32_mquickjs_spi_bus_slot_t *slot;

    if (spi_bus_ref_from_object(ctx, this_value, api_name, out_ref) != 0) {
        return -1;
    }
    slot = spi_get_bus_slot(out_ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the SPI bus is closed", api_name);
        return -1;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static int spi_get_this_device_slots(JSContext *ctx,
                                     JSValue this_value,
                                     const char *api_name,
                                     esp32_mquickjs_spi_device_ref_t *out_ref,
                                     esp32_mquickjs_spi_device_slot_t **out_device_slot,
                                     esp32_mquickjs_spi_bus_slot_t **out_bus_slot)
{
    esp32_mquickjs_spi_device_slot_t *device_slot;
    esp32_mquickjs_spi_bus_slot_t *bus_slot;

    if (spi_device_ref_from_object(ctx, this_value, api_name, out_ref) != 0) {
        return -1;
    }
    device_slot = spi_get_device_slot(out_ref);
    if (device_slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the SPI device is closed", api_name);
        return -1;
    }
    bus_slot = spi_get_bus_slot_by_ids(device_slot->parent_bus_slot_id, device_slot->parent_bus_generation);
    if (bus_slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the parent SPI bus is closed", api_name);
        return -1;
    }
    if (out_device_slot != NULL) {
        *out_device_slot = device_slot;
    }
    if (out_bus_slot != NULL) {
        *out_bus_slot = bus_slot;
    }
    return 0;
}

static JSValue spi_make_bus_status_object(JSContext *ctx, const esp32_mquickjs_spi_bus_slot_t *slot)
{
    JSGCRef status_ref;
    JSValue *status_obj;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "opened",
                                     JS_NewBool(slot != NULL && slot->allocated)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "host",
                                     JS_NewInt32(ctx, slot != NULL ? slot->host_number : ESP32_MQUICKJS_SPI_DEFAULT_HOST_NUMBER)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "sclk",
                                     JS_NewInt32(ctx, slot != NULL ? slot->sclk_pin : ESP32_MQUICKJS_SPI_DEFAULT_SCLK_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "mosi",
                                     JS_NewInt32(ctx, slot != NULL ? slot->mosi_pin : ESP32_MQUICKJS_SPI_DEFAULT_MOSI_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "miso",
                                     JS_NewInt32(ctx, slot != NULL ? slot->miso_pin : ESP32_MQUICKJS_SPI_DEFAULT_MISO_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "maxTransferSize",
                                     JS_NewUint32(ctx, slot != NULL ? slot->max_transfer_size
                                                                    : ESP32_MQUICKJS_SPI_DEFAULT_MAX_TRANSFER_SIZE)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "deviceCount",
                                     JS_NewUint32(ctx, slot != NULL ? slot->open_devices : 0))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

static JSValue spi_make_device_status_object(JSContext *ctx,
                                             const esp32_mquickjs_spi_device_slot_t *device_slot,
                                             const esp32_mquickjs_spi_bus_slot_t *bus_slot)
{
    JSGCRef status_ref;
    JSValue *status_obj;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "opened",
                                     JS_NewBool(device_slot != NULL && device_slot->allocated)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "host",
                                     JS_NewInt32(ctx, bus_slot != NULL ? bus_slot->host_number : ESP32_MQUICKJS_SPI_DEFAULT_HOST_NUMBER)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "cs",
                                     JS_NewInt32(ctx, device_slot != NULL ? device_slot->cs_pin : ESP32_MQUICKJS_SPI_DEFAULT_CS_PIN)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "mode",
                                     JS_NewInt32(ctx, device_slot != NULL ? device_slot->mode : 0)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "freqHz",
                                     JS_NewUint32(ctx, device_slot != NULL ? device_slot->freq_hz
                                                                           : ESP32_MQUICKJS_SPI_DEFAULT_FREQ_HZ)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "queueSize",
                                     JS_NewUint32(ctx, device_slot != NULL ? device_slot->queue_size
                                                                           : ESP32_MQUICKJS_SPI_DEFAULT_QUEUE_SIZE)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "csHigh",
                                     JS_NewBool(device_slot != NULL && device_slot->cs_high)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "lsbFirst",
                                     JS_NewBool(device_slot != NULL && device_slot->lsb_first))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

