99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
static JSValue spi_make_bus_object(JSContext *ctx, const esp32_mquickjs_spi_bus_slot_t *slot)
{
    JSGCRef bus_ref;
    JSValue *bus_obj;
    esp32_mquickjs_spi_bus_ref_t *bus_data;

    bus_obj = JS_PushGCRef(ctx, &bus_ref);
    *bus_obj = JS_NewObjectClassUser(ctx, JS_CLASS_SPI_BUS);
    if (JS_IsException(*bus_obj) || slot == NULL) {
        JS_PopGCRef(ctx, &bus_ref);
        return JS_EXCEPTION;
    }

    bus_data = heap_caps_malloc(sizeof(*bus_data), MALLOC_CAP_8BIT);
    if (bus_data == NULL) {
        JS_PopGCRef(ctx, &bus_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    bus_data->slot_id = slot->slot_id;
    bus_data->generation = slot->generation;
    JS_SetOpaque(ctx, *bus_obj, bus_data);

    return JS_PopGCRef(ctx, &bus_ref);
}

static JSValue spi_make_device_object(JSContext *ctx, const esp32_mquickjs_spi_device_slot_t *slot)
{
    JSGCRef device_ref;
    JSValue *device_obj;
    esp32_mquickjs_spi_device_ref_t *device_data;

    device_obj = JS_PushGCRef(ctx, &device_ref);
    *device_obj = JS_NewObjectClassUser(ctx, JS_CLASS_SPI_DEVICE);
    if (JS_IsException(*device_obj) || slot == NULL) {
        JS_PopGCRef(ctx, &device_ref);
        return JS_EXCEPTION;
    }

    device_data = heap_caps_malloc(sizeof(*device_data), MALLOC_CAP_8BIT);
    if (device_data == NULL) {
        JS_PopGCRef(ctx, &device_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    device_data->slot_id = slot->slot_id;
    device_data->generation = slot->generation;
    JS_SetOpaque(ctx, *device_obj, device_data);

    return JS_PopGCRef(ctx, &device_ref);
}

static JSValue js_bytes_to_array(JSContext *ctx, const uint8_t *bytes, size_t length)
{
    JSGCRef array_ref;
    JSValue *array_obj;
    uint32_t i;

    array_obj = JS_PushGCRef(ctx, &array_ref);
    *array_obj = JS_NewArray(ctx, 0);
    if (JS_IsException(*array_obj)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    for (i = 0; i < length; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array_obj, i, JS_NewInt32(ctx, bytes[i])))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
    }

    return JS_PopGCRef(ctx, &array_ref);
}

typedef struct {
    uint32_t queue_depth;
} spi_write_chunks_options_t;

static bool spi_parse_write_chunks_options(JSContext *ctx,
                                           JSValue options,
                                           const char *api_name,
                                           spi_write_chunks_options_t *out_options)
{
    out_options->queue_depth = 2;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    if (JS_GetClassID(ctx, options) < 0) {
        JS_ThrowTypeError(ctx, "%s options must be an object", api_name);
        return false;
    }

    {
        JSGCRef property_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, options, "queueDepth");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return false;
        }
        if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
            (!js_value_to_u32(ctx, *property, &out_options->queue_depth) || out_options->queue_depth == 0U)) {
            JS_PopGCRef(ctx, &property_ref);
            JS_ThrowTypeError(ctx, "%s option 'queueDepth' expects a positive integer", api_name);
            return false;
        }
        JS_PopGCRef(ctx, &property_ref);
    }
    return true;
}

static uint32_t spi_clamp_queue_depth(const esp32_mquickjs_spi_device_slot_t *device_slot, uint32_t requested_depth)
{
    uint32_t depth = requested_depth;

    if (device_slot != NULL && depth > device_slot->queue_size) {
        depth = device_slot->queue_size;
    }
    if (depth > 2U) {
        depth = 2U;
    }
    if (depth < 1U) {
        depth = 1U;
    }
    return depth;
}

static bool spi_byte_source_can_dma(const esp32_mquickjs_byte_source_t *source)
{
    if (source == NULL || source->length == 0) {
        return true;
    }
    return source->data != NULL &&
           esp_ptr_dma_capable(source->data) &&
           (((uintptr_t)source->data) & 3U) == 0U &&
           (source->length & 3U) == 0U;
}

static bool spi_byte_span_can_dma(const esp32_mquickjs_byte_span_t *span)
{
    if (span == NULL || span->length == 0) {
        return true;
    }
    return span->dma_capable &&
           span->data != NULL &&
           esp_ptr_dma_capable(span->data) &&
           (((uintptr_t)span->data) & 3U) == 0U &&
           (span->length & 3U) == 0U;
}

typedef struct {
    JSGCRef owner_ref;
    bool rooted;
} spi_span_owner_root_t;

static void spi_root_span_owner(JSContext *ctx, spi_span_owner_root_t *root, JSValue owner)
{
    JSValue *owner_value;

    if (root == NULL || JS_IsUndefined(owner)) {
        return;
    }
    owner_value = JS_AddGCRef(ctx, &root->owner_ref);
    *owner_value = owner;
    root->rooted = true;
}

static void spi_release_span_owner(JSContext *ctx, spi_span_owner_root_t *root)
{
    if (root == NULL || !root->rooted) {
        return;
    }
    JS_DeleteGCRef(ctx, &root->owner_ref);
    root->rooted = false;
}

static bool spi_ensure_tx_dma_buffer(esp32_mquickjs_spi_device_slot_t *device_slot,
                                     uint32_t slot_index,
                                     size_t length)
{
    uint8_t *buffer;

    if (device_slot == NULL || slot_index >= 2U) {
        return false;
    }
    if (device_slot->tx_dma_buffers[slot_index] != NULL &&
        device_slot->tx_dma_capacities[slot_index] >= length) {
        return true;
    }

    buffer = heap_caps_malloc(length, MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    if (buffer == NULL) {
        return false;
    }
    heap_caps_free(device_slot->tx_dma_buffers[slot_index]);
    device_slot->tx_dma_buffers[slot_index] = buffer;
    device_slot->tx_dma_capacities[slot_index] = length;
    return true;
}

static TickType_t spi_cooperative_wait_ticks(void)
{
    TickType_t ticks = pdMS_TO_TICKS(ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS);

    return ticks > 0 ? ticks : 1;
}

static esp_err_t spi_queue_transaction_cooperatively(spi_device_handle_t handle,
                                                     spi_transaction_t *transaction)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    esp_err_t err;

    esp32_mquickjs_native_wait_begin(runtime, &wait);
    do {
        if (!esp32_mquickjs_cooperate(runtime)) {
            err = ESP_ERR_INVALID_STATE;
            break;
        }
        err = spi_device_queue_trans(handle, transaction, spi_cooperative_wait_ticks());
    } while (err == ESP_ERR_TIMEOUT);
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return err;
}

static esp_err_t spi_wait_queued_write(spi_device_handle_t handle, uint64_t *wait_us)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    spi_transaction_t *completed = NULL;
    int64_t wait_start = esp_timer_get_time();
    esp_err_t err;
    bool interrupted = false;

    esp32_mquickjs_native_wait_begin(runtime, &wait);
    do {
        if (!esp32_mquickjs_cooperate(runtime)) {
            interrupted = true;
        }
        err = spi_device_get_trans_result(handle, &completed, spi_cooperative_wait_ticks());
    } while (err == ESP_ERR_TIMEOUT);
    esp32_mquickjs_native_wait_end(runtime, &wait);

    *wait_us += (uint64_t)(esp_timer_get_time() - wait_start);
    if (err == ESP_OK && interrupted) {
        return ESP_ERR_INVALID_STATE;
    }
    return err;
}

static JSValue spi_make_write_chunks_stats(JSContext *ctx,
                                           uint32_t chunks,
                                           size_t bytes,
                                           uint64_t prep_us,
                                           uint64_t queue_us,
                                           uint64_t wait_us,
                                           uint64_t total_us,
                                           uint32_t queue_depth,
                                           bool direct)
{
    JSGCRef stats_ref;
    JSValue *stats;

    stats = JS_PushGCRef(ctx, &stats_ref);
    *stats = JS_NewObject(ctx);
    if (JS_IsException(*stats)) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, stats, "chunks", JS_NewUint32(ctx, chunks)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "bytes", JS_NewInt64(ctx, (int64_t)bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "prepUs", JS_NewInt64(ctx, (int64_t)prep_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "queueUs", JS_NewInt64(ctx, (int64_t)queue_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "waitUs", JS_NewInt64(ctx, (int64_t)wait_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "transferUs",
                                     JS_NewInt64(ctx, (int64_t)(total_us > prep_us ? total_us - prep_us : 0U))) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "totalUs", JS_NewInt64(ctx, (int64_t)total_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "queueDepth", JS_NewUint32(ctx, queue_depth)) ||
        !esp32_mquickjs_set_property_ref(ctx, stats, "direct", direct ? JS_TRUE : JS_FALSE)) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

