99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
    return JS_PopGCRef(ctx, &stats_ref);
}

static JSValue spi_write_span_source(JSContext *ctx,
                                     const esp32_mquickjs_spi_bus_slot_t *bus_slot,
                                     esp32_mquickjs_spi_device_slot_t *device_slot,
                                     esp32_mquickjs_byte_span_source_t *source,
                                     const spi_write_chunks_options_t *options,
                                     const char *api_name)
{
    spi_transaction_t transactions[2];
    spi_span_owner_root_t active_owners[2];
    uint32_t queue_head = 0;
    uint32_t queue_tail = 0;
    uint32_t in_flight = 0;
    uint32_t max_in_flight;
    uint32_t queued_chunks = 0;
    size_t bytes = 0;
    uint64_t prep_us = 0;
    uint64_t queue_us = 0;
    uint64_t wait_us = 0;
    uint64_t total_us;
    int64_t total_start;
    bool direct = true;
    JSValue error = JS_UNDEFINED;
    esp_err_t err = ESP_OK;

    memset(transactions, 0, sizeof(transactions));
    memset(active_owners, 0, sizeof(active_owners));

    if (bus_slot == NULL || device_slot == NULL || source == NULL || options == NULL) {
        return JS_ThrowInternalError(ctx, "%s received invalid SPI span source state", api_name);
    }

    max_in_flight = spi_clamp_queue_depth(device_slot, options->queue_depth);
    total_start = esp_timer_get_time();

    while (true) {
        esp32_mquickjs_byte_span_t span;
        size_t span_length;
        uint32_t slot_index;
        int64_t step_start;

        while (in_flight >= max_in_flight) {
            err = spi_wait_queued_write(device_slot->handle, &wait_us);
            spi_release_span_owner(ctx, &active_owners[queue_head]);
            if (err != ESP_OK) {
                goto fail;
            }
            queue_head = (queue_head + 1U) % max_in_flight;
            in_flight--;
        }

        if (!esp32_mquickjs_byte_span_source_next(ctx, source, &span)) {
            if (JS_HasException(ctx)) {
                error = JS_EXCEPTION;
                goto fail_with_js_error;
            }
            break;
        }

        span_length = span.length;
        if (span_length == 0) {
            continue;
        }
        if (span.data == NULL) {
            error = JS_ThrowInternalError(ctx, "%s received a non-empty span with null data", api_name);
            goto fail_with_js_error;
        }
        if (span_length > bus_slot->max_transfer_size) {
            error = JS_ThrowRangeError(ctx,
                                       "%s span length (%u) exceeds SPIBus maxTransferSize (%u)",
                                       api_name,
                                       (unsigned)span_length,
                                       (unsigned)bus_slot->max_transfer_size);
            goto fail_with_js_error;
        }

        slot_index = queue_tail;
        memset(&transactions[slot_index], 0, sizeof(transactions[slot_index]));
        transactions[slot_index].length = span_length * 8U;
        if (spi_byte_span_can_dma(&span)) {
            transactions[slot_index].tx_buffer = span.data;
            spi_root_span_owner(ctx, &active_owners[slot_index], span.owner);
        } else {
            step_start = esp_timer_get_time();
            if (!spi_ensure_tx_dma_buffer(device_slot, slot_index, span_length)) {
                error = JS_ThrowOutOfMemory(ctx);
                goto fail_with_js_error;
            }
            memcpy(device_slot->tx_dma_buffers[slot_index], span.data, span_length);
            prep_us += (uint64_t)(esp_timer_get_time() - step_start);
            transactions[slot_index].tx_buffer = device_slot->tx_dma_buffers[slot_index];
            direct = false;
        }

        step_start = esp_timer_get_time();
        err = spi_queue_transaction_cooperatively(device_slot->handle, &transactions[slot_index]);
        queue_us += (uint64_t)(esp_timer_get_time() - step_start);
        if (err != ESP_OK) {
            spi_release_span_owner(ctx, &active_owners[slot_index]);
            goto fail;
        }

        queue_tail = (queue_tail + 1U) % max_in_flight;
        in_flight++;
        queued_chunks++;
        bytes += span_length;
    }

    while (in_flight > 0) {
        err = spi_wait_queued_write(device_slot->handle, &wait_us);
        spi_release_span_owner(ctx, &active_owners[queue_head]);
        if (err != ESP_OK) {
            goto fail;
        }
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }

    total_us = (uint64_t)(esp_timer_get_time() - total_start);
    return spi_make_write_chunks_stats(ctx,
                                       queued_chunks,
                                       bytes,
                                       prep_us,
                                       queue_us,
                                       wait_us,
                                       total_us,
                                       max_in_flight,
                                       direct);

fail_with_js_error:
    while (in_flight > 0) {
        (void)spi_wait_queued_write(device_slot->handle, &wait_us);
        spi_release_span_owner(ctx, &active_owners[queue_head]);
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }
    return error;

fail:
    while (in_flight > 0) {
        esp_err_t wait_err = spi_wait_queued_write(device_slot->handle, &wait_us);

        spi_release_span_owner(ctx, &active_owners[queue_head]);
        if (err == ESP_OK) {
            err = wait_err;
        }
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }
    return spi_throw_error(ctx, err, "SPIDevice.writeSource() failed");
}

static JSValue spi_open_bus(JSContext *ctx, int argc, JSValue *argv)
{
    int32_t host_number = ESP32_MQUICKJS_SPI_DEFAULT_HOST_NUMBER;
    int32_t sclk_pin = ESP32_MQUICKJS_SPI_DEFAULT_SCLK_PIN;
    int32_t mosi_pin = ESP32_MQUICKJS_SPI_DEFAULT_MOSI_PIN;
    int32_t miso_pin = ESP32_MQUICKJS_SPI_DEFAULT_MISO_PIN;
    uint32_t max_transfer_size = ESP32_MQUICKJS_SPI_DEFAULT_MAX_TRANSFER_SIZE;
    spi_bus_config_t bus_config = {0};
    esp32_mquickjs_spi_bus_slot_t *slot;
    JSValue result;
    esp_err_t err;

    if (argc >= 1 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSValue *property;

        if (JS_GetClassID(ctx, argv[0]) < 0) {
            return JS_ThrowTypeError(ctx,
                                     "spi.openBus(options?) expects an object with host?/sclk?/mosi?/miso?/maxTransferSize?");
        }

        property = JS_PushGCRef(ctx, &property_ref);

