99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
        *property = JS_GetPropertyStr(ctx, argv[0], "host");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_spi_host_number(ctx, *property, &host_number)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "spi.openBus({ host }) expects spi.HOST_2 or spi.HOST_3");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "sclk");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &sclk_pin, false)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "spi.openBus({ sclk }) expects a valid GPIO");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "mosi");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &mosi_pin, true)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "spi.openBus({ mosi }) expects a valid GPIO or -1");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "miso");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &miso_pin, true)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "spi.openBus({ miso }) expects a valid GPIO or -1");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "maxTransferSize");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) &&
            (!js_value_to_u32(ctx, *property, &max_transfer_size) || max_transfer_size == 0U)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "spi.openBus({ maxTransferSize }) expects a positive integer");
        }

        JS_PopGCRef(ctx, &property_ref);
    }

    if (!GPIO_IS_VALID_GPIO(sclk_pin)) {
        return JS_ThrowTypeError(ctx, "spi.openBus() requires a valid default SCLK GPIO or an explicit { sclk } override");
    }

    slot = spi_alloc_bus_slot(host_number);
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "spi.openBus() failed: selected SPI host is unavailable or already in use");
    }

    bus_config.mosi_io_num = mosi_pin;
    bus_config.miso_io_num = miso_pin;
    bus_config.sclk_io_num = sclk_pin;
    bus_config.quadwp_io_num = -1;
    bus_config.quadhd_io_num = -1;
    bus_config.data4_io_num = -1;
    bus_config.data5_io_num = -1;
    bus_config.data6_io_num = -1;
    bus_config.data7_io_num = -1;
    bus_config.max_transfer_sz = (int)max_transfer_size;
    bus_config.flags = SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_SCLK;
    if (mosi_pin >= 0) {
        bus_config.flags |= SPICOMMON_BUSFLAG_MOSI;
    }
    if (miso_pin >= 0) {
        bus_config.flags |= SPICOMMON_BUSFLAG_MISO;
    }

    err = spi_bus_initialize(slot->host_id, &bus_config, SPI_DMA_CH_AUTO);
    if (err != ESP_OK) {
        spi_cleanup_bus_slot(slot);
        return spi_throw_error(ctx, err, "spi.openBus() failed");
    }

    slot->sclk_pin = sclk_pin;
    slot->mosi_pin = mosi_pin;
    slot->miso_pin = miso_pin;
    slot->max_transfer_size = max_transfer_size;

    result = spi_make_bus_object(ctx, slot);
    if (JS_IsException(result)) {
        spi_cleanup_bus_slot(slot);
    }
    return result;
}

void esp32_mquickjs_deinit_spi_runtime(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_BUS_SLOT_COUNT; ++i) {
        if (s_spi_bus_slots[i].allocated) {
            spi_cleanup_bus_slot(&s_spi_bus_slots[i]);
        }
    }
    for (i = 0; i < (int32_t)ESP32_MQUICKJS_SPI_DEVICE_SLOT_COUNT; ++i) {
        if (s_spi_device_slots[i].allocated) {
            spi_cleanup_device_slot(&s_spi_device_slots[i]);
        }
    }
    spi_reset_slots();
}

bool esp32_mquickjs_init_spi_runtime(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_deinit_spi_runtime();
    return spi_register_future_drivers(ctx, runtime);
}

JSValue js_spi_bus_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "SPIBus cannot be constructed directly");
}

void js_spi_bus_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_spi_bus_ref_t *bus_ref = opaque;
    esp32_mquickjs_spi_bus_slot_t *slot;

    (void)ctx;

    if (bus_ref == NULL) {
        return;
    }

    slot = spi_get_bus_slot(bus_ref);
    if (slot != NULL) {
        spi_cleanup_bus_slot(slot);
    }
    heap_caps_free(bus_ref);
}

JSValue js_spi_bus_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_bus_ref_t bus_ref;
    esp32_mquickjs_spi_bus_ref_t *bus_ref_ptr;
    esp32_mquickjs_spi_bus_slot_t *slot;

    (void)argc;
    (void)argv;

    if (spi_bus_ref_from_object(ctx, *this_val, "SPIBus.close()", &bus_ref) != 0) {
        return JS_EXCEPTION;
    }
    slot = spi_get_bus_slot(&bus_ref);
    if (slot != NULL) {
        spi_cleanup_bus_slot(slot);
    }
    bus_ref_ptr = JS_GetOpaque(ctx, *this_val);
    if (bus_ref_ptr != NULL) {
        bus_ref_ptr->slot_id = -1;
        bus_ref_ptr->generation = 0;
    }
    return JS_TRUE;
}

JSValue js_spi_bus_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_bus_ref_t bus_ref;
    esp32_mquickjs_spi_bus_slot_t *slot = NULL;

    (void)argc;
    (void)argv;

    if (spi_get_this_bus_slot(ctx, *this_val, "SPIBus.status()", &bus_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    return spi_make_bus_status_object(ctx, slot);
}

JSValue js_spi_bus_open_device(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_bus_ref_t bus_ref;
    esp32_mquickjs_spi_bus_slot_t *bus_slot = NULL;
    esp32_mquickjs_spi_device_slot_t *device_slot;
    spi_device_interface_config_t device_config = {0};
    int32_t cs_pin = ESP32_MQUICKJS_SPI_DEFAULT_CS_PIN;
    uint8_t mode = 0;
    uint32_t freq_hz = ESP32_MQUICKJS_SPI_DEFAULT_FREQ_HZ;
    uint32_t queue_size = ESP32_MQUICKJS_SPI_DEFAULT_QUEUE_SIZE;
    bool cs_high = false;
    bool lsb_first = false;
    JSValue result;
    esp_err_t err;

