99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
    if (spi_get_this_bus_slot(ctx, *this_val, "SPIBus.openDevice()", &bus_ref, &bus_slot) != 0) {
        return JS_EXCEPTION;
    }

    if (argc >= 1 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSValue *property;

        if (JS_GetClassID(ctx, argv[0]) < 0) {
            return JS_ThrowTypeError(ctx,
                                     "SPIBus.openDevice(options?) expects an object with cs?/freqHz?/mode?/queueSize?/csHigh?/lsbFirst?");
        }

        property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "cs");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &cs_pin, true)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ cs }) expects a valid GPIO or -1");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "freqHz");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (JS_IsUndefined(*property)) {
            *property = JS_GetPropertyStr(ctx, argv[0], "freq");
            if (JS_IsException(*property)) {
                JS_PopGCRef(ctx, &property_ref);
                return JS_EXCEPTION;
            }
        }
        if (!JS_IsUndefined(*property) && (!js_value_to_u32(ctx, *property, &freq_hz) || freq_hz == 0U)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ freqHz }) expects a positive integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "mode");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_spi_mode(ctx, *property, &mode)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ mode }) expects 0, 1, 2, or 3");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "queueSize");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && (!js_value_to_u32(ctx, *property, &queue_size) || queue_size == 0U)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ queueSize }) expects a positive integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "csHigh");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_bool(ctx, *property, &cs_high)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ csHigh }) expects a boolean-like value");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "lsbFirst");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_bool(ctx, *property, &lsb_first)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "SPIBus.openDevice({ lsbFirst }) expects a boolean-like value");
        }

        JS_PopGCRef(ctx, &property_ref);
    }

    device_slot = spi_alloc_device_slot(bus_slot);
    if (device_slot == NULL) {
        return JS_ThrowInternalError(ctx, "SPIBus.openDevice() failed: no available SPIDevice slots");
    }

    device_config.mode = mode;
    device_config.clock_source = SPI_CLK_SRC_DEFAULT;
    device_config.clock_speed_hz = (int)freq_hz;
    device_config.spics_io_num = cs_pin;
    device_config.queue_size = (int)queue_size;
    device_config.flags = 0;
    if (cs_high) {
        device_config.flags |= SPI_DEVICE_POSITIVE_CS;
    }
    if (lsb_first) {
        device_config.flags |= SPI_DEVICE_BIT_LSBFIRST;
    }

    err = spi_bus_add_device(bus_slot->host_id, &device_config, &device_slot->handle);
    if (err != ESP_OK) {
        spi_cleanup_device_slot(device_slot);
        return spi_throw_error(ctx, err, "SPIBus.openDevice() failed");
    }

    device_slot->cs_pin = cs_pin;
    device_slot->mode = mode;
    device_slot->freq_hz = freq_hz;
    device_slot->queue_size = queue_size;
    device_slot->cs_high = cs_high;
    device_slot->lsb_first = lsb_first;

    result = spi_make_device_object(ctx, device_slot);
    if (JS_IsException(result)) {
        spi_cleanup_device_slot(device_slot);
    }
    return result;
}

JSValue js_spi_device_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "SPIDevice cannot be constructed directly");
}

void js_spi_device_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_spi_device_ref_t *device_ref = opaque;
    esp32_mquickjs_spi_device_slot_t *slot;

    (void)ctx;

    if (device_ref == NULL) {
        return;
    }

    slot = spi_get_device_slot(device_ref);
    if (slot != NULL) {
        spi_cleanup_device_slot(slot);
    }
    heap_caps_free(device_ref);
}

JSValue js_spi_device_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_device_ref_t device_ref;
    esp32_mquickjs_spi_device_ref_t *device_ref_ptr;
    esp32_mquickjs_spi_device_slot_t *slot;

    (void)argc;
    (void)argv;

    if (spi_device_ref_from_object(ctx, *this_val, "SPIDevice.close()", &device_ref) != 0) {
        return JS_EXCEPTION;
    }
    slot = spi_get_device_slot(&device_ref);
    if (slot != NULL) {
        if (slot->busy) {
            return JS_ThrowInternalError(ctx,
                                         "SPIDevice.close() refused while a transaction is pending");
        }
        spi_cleanup_device_slot(slot);
    }
    device_ref_ptr = JS_GetOpaque(ctx, *this_val);
    if (device_ref_ptr != NULL) {
        device_ref_ptr->slot_id = -1;
        device_ref_ptr->generation = 0;
    }
    return JS_TRUE;
}

JSValue js_spi_device_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_device_ref_t device_ref;
    esp32_mquickjs_spi_device_slot_t *device_slot = NULL;
    esp32_mquickjs_spi_bus_slot_t *bus_slot = NULL;

    (void)argc;
    (void)argv;

