99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
    if (spi_get_this_device_slots(ctx,
                                  *this_val,
                                  "SPIDevice.status()",
                                  &device_ref,
                                  &device_slot,
                                  &bus_slot) != 0) {
        return JS_EXCEPTION;
    }
    return spi_make_device_status_object(ctx, device_slot, bus_slot);
}

typedef enum {
    SPI_FUTURE_TRANSFER,
    SPI_FUTURE_WRITE,
    SPI_FUTURE_READ,
} spi_future_kind_t;

struct esp32_mquickjs_future_driver_state {
    spi_future_kind_t kind;
    JSContext *ctx;
    JSGCRef owner_ref;
    esp32_mquickjs_spi_device_ref_t device_ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp_timer_handle_t poll_timer;
    spi_transaction_t transaction;
    uint8_t *tx_data;
    uint8_t *rx_data;
    size_t length;
    esp_err_t err;
    bool owner_retained;
    bool started;
    bool queued;
    bool completed;
    bool cancelled;
};

static void spi_future_release(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->poll_timer != NULL) {
        (void)esp_timer_stop(state->poll_timer);
        (void)esp_timer_delete(state->poll_timer);
    }
    if (state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    heap_caps_free(state->tx_data);
    heap_caps_free(state->rx_data);
    heap_caps_free(state);
}

static esp32_mquickjs_future_driver_state_t *spi_future_allocate(
    JSContext *ctx,
    JSValue this_value,
    spi_future_kind_t kind)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_spi_device_slot_t *device = NULL;
    esp32_mquickjs_spi_bus_slot_t *bus = NULL;
    JSValue *owner;

    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    if (spi_get_this_device_slots(ctx, this_value, "SPI Future operation",
                                  &state->device_ref, &device, &bus) != 0) {
        heap_caps_free(state);
        return NULL;
    }
    if (device->busy) {
        heap_caps_free(state);
        JS_ThrowInternalError(ctx, "SPI device is busy");
        return NULL;
    }
    state->kind = kind;
    state->ctx = ctx;
    owner = JS_AddGCRef(ctx, &state->owner_ref);
    *owner = this_value;
    state->owner_retained = true;
    return state;
}

static bool spi_future_allocate_buffers(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state,
    const uint8_t *source,
    size_t length,
    uint8_t fill_byte,
    bool receive)
{
    esp32_mquickjs_spi_device_slot_t *device = spi_get_device_slot(&state->device_ref);
    esp32_mquickjs_spi_bus_slot_t *bus = device != NULL
        ? spi_get_bus_slot_by_ids(device->parent_bus_slot_id,
                                  device->parent_bus_generation)
        : NULL;

    if (device == NULL || bus == NULL) {
        JS_ThrowReferenceError(ctx, "SPI device is closed");
        return false;
    }
    if (length > bus->max_transfer_size) {
        JS_ThrowRangeError(ctx,
                           "SPI transfer length (%u) exceeds SPIBus maxTransferSize (%u)",
                           (unsigned)length,
                           (unsigned)bus->max_transfer_size);
        return false;
    }
    state->length = length;
    if (length == 0) {
        return true;
    }
    state->tx_data = heap_caps_malloc(length, MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    if (state->tx_data == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    if (source != NULL) {
        memcpy(state->tx_data, source, length);
    } else {
        memset(state->tx_data, fill_byte, length);
    }
    if (receive) {
        state->rx_data = heap_caps_malloc(length,
                                          MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
        if (state->rx_data == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    }
    state->transaction.length = length * 8U;
    state->transaction.rxlength = receive ? length * 8U : 0;
    state->transaction.tx_buffer = state->tx_data;
    state->transaction.rx_buffer = state->rx_data;
    return true;
}

static bool spi_source_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    spi_future_kind_t kind,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    bool result;

    if (out_state == NULL || argc != 1 ||
        !esp32_mquickjs_get_byte_source(ctx,
                                       argc > 0 ? argv[0].val : JS_UNDEFINED,
                                       kind == SPI_FUTURE_TRANSFER
                                           ? "SPIDevice.transfer(data)"
                                           : "SPIDevice.write(data)",
                                       &source,
                                       &owned,
                                       &error)) {
        if (JS_IsUndefined(error)) {
            JS_ThrowTypeError(ctx, "SPI operation expects an array-like byte sequence");
        }
        return false;
    }
    state = spi_future_allocate(ctx, this_ref->val, kind);
    if (state == NULL) {
        esp32_mquickjs_release_byte_source(owned);
        return false;
    }
    result = spi_future_allocate_buffers(ctx, state,
                                         source.data, source.length, 0,
                                         kind == SPI_FUTURE_TRANSFER);
    esp32_mquickjs_release_byte_source(owned);
    if (!result) {
        spi_future_release(state);
        return false;
    }
    *out_state = state;
    return true;
}

static bool spi_transfer_future_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return spi_source_future_prepare(ctx, this_ref, argc, argv,
                                     SPI_FUTURE_TRANSFER, out_state);
}

static bool spi_write_future_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return spi_source_future_prepare(ctx, this_ref, argc, argv,
                                     SPI_FUTURE_WRITE, out_state);
}

