99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
static bool spi_read_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t length;
    uint32_t fill = 0;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        !js_value_to_u32(ctx, argv[0].val, &length) ||
        (argc == 2 && !JS_IsUndefined(argv[1].val) &&
         (!js_value_to_u32(ctx, argv[1].val, &fill) || fill > 0xffU))) {
        JS_ThrowTypeError(ctx,
                          "SPIDevice.read(length, fillByte?) expects a byte length and fillByte 0-255");
        return false;
    }
    state = spi_future_allocate(ctx, this_ref->val, SPI_FUTURE_READ);
    if (state == NULL) {
        return false;
    }
    if (!spi_future_allocate_buffers(ctx, state, NULL, length,
                                     (uint8_t)fill, true)) {
        spi_future_release(state);
        return false;
    }
    *out_state = state;
    return true;
}

static void spi_future_timer(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state != NULL && !state->completed) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
}

static void spi_future_step(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_spi_device_slot_t *device;
    spi_transaction_t *completed = NULL;

    if (state == NULL || state->completed) {
        return;
    }
    device = spi_get_device_slot(&state->device_ref);
    if (device == NULL) {
        state->err = ESP_ERR_INVALID_STATE;
        state->completed = true;
        return;
    }
    if (state->length == 0 || (state->cancelled && !state->queued)) {
        state->completed = true;
        return;
    }
    if (!state->queued) {
        state->err = spi_device_queue_trans(device->handle,
                                            &state->transaction,
                                            0);
        if (state->err == ESP_ERR_TIMEOUT) {
            state->err = ESP_OK;
            return;
        }
        if (state->err != ESP_OK) {
            state->completed = true;
            return;
        }
        state->queued = true;
    }
    state->err = spi_device_get_trans_result(device->handle, &completed, 0);
    if (state->err == ESP_ERR_TIMEOUT) {
        state->err = ESP_OK;
        return;
    }
    state->completed = true;
}

static bool spi_future_start(JSContext *ctx,
                             esp32_mquickjs_runtime_t *runtime,
                             esp32_mquickjs_future_token_t token,
                             esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_spi_device_slot_t *device = state != NULL
        ? spi_get_device_slot(&state->device_ref) : NULL;
    esp_timer_create_args_t args = {
        .callback = spi_future_timer,
        .arg = state,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "mqjs_spi",
        .skip_unhandled_events = true,
    };

    if (state == NULL || device == NULL) {
        JS_ThrowReferenceError(ctx, "SPI device closed before transaction start");
        return false;
    }
    if (device->busy) {
        JS_ThrowInternalError(ctx, "SPI device is busy");
        return false;
    }
    device->busy = true;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    spi_future_step(state);
    if (!state->completed &&
        (esp_timer_create(&args, &state->poll_timer) != ESP_OK ||
         esp_timer_start_periodic(state->poll_timer, 1000U) != ESP_OK)) {
        JS_ThrowInternalError(ctx, "failed to start SPI completion poller");
        return false;
    }
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t spi_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    spi_future_step(state);
    return state != NULL && state->completed
        ? ESP32_MQUICKJS_FUTURE_READY
        : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue spi_future_finish(JSContext *ctx,
                                 esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "SPI transaction cancelled");
    }
    if (state->err != ESP_OK) {
        return spi_throw_error(ctx, state->err, "SPI transaction failed");
    }
    if (state->kind == SPI_FUTURE_WRITE) {
        return JS_NewInt32(ctx, (int32_t)state->length);
    }
    return js_bytes_to_array(ctx, state->rx_data, state->length);
}

static bool spi_future_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->cancelled) {
        return false;
    }
    state->cancelled = true;
    if (!state->queued) {
        state->completed = true;
    }
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return true;
}

static void spi_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_spi_device_slot_t *device = state != NULL
        ? spi_get_device_slot(&state->device_ref) : NULL;

    if (device != NULL && state->started) {
        device->busy = false;
    }
    spi_future_release(state);
}

#define SPI_FUTURE_DRIVER(name, prepare_fn) \
    static const esp32_mquickjs_future_driver_t name = { \
        .prepare = prepare_fn, \
        .start = spi_future_start, \
        .poll = spi_future_poll, \
        .finish = spi_future_finish, \
        .cancel = spi_future_cancel, \
        .destroy = spi_future_destroy, \
    }

SPI_FUTURE_DRIVER(s_spi_transfer_driver, spi_transfer_future_prepare);
SPI_FUTURE_DRIVER(s_spi_write_driver, spi_write_future_prepare);
SPI_FUTURE_DRIVER(s_spi_read_driver, spi_read_future_prepare);

#undef SPI_FUTURE_DRIVER

static JSValue spi_future_call_and_wait(JSContext *ctx,
                                        JSValue receiver,
                                        const char *method_name,
                                        int argc,
                                        JSValue *argv)
{
    JSGCRef receiver_ref;
    JSGCRef method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(ctx,
                                              esp32_mquickjs_get_active_runtime(),
                                              *method,
                                              *rooted_receiver,
                                              argc,
                                              argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

static bool spi_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef object_ref;
    JSGCRef transfer_ref;
    JSGCRef write_ref;
    JSGCRef read_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *transfer_fn = JS_PushGCRef(ctx, &transfer_ref);
    JSValue *write_fn = JS_PushGCRef(ctx, &write_ref);
    JSValue *read_fn = JS_PushGCRef(ctx, &read_ref);
    bool result;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_SPI_DEVICE);
    *transfer_fn = JS_IsException(*object) ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *object, "transfer");
    *write_fn = JS_IsException(*object) ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *object, "write");
    *read_fn = JS_IsException(*object) ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *object, "read");
    result = !JS_IsException(*transfer_fn) && !JS_IsException(*write_fn) &&
             !JS_IsException(*read_fn) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *transfer_fn,
                                                    &s_spi_transfer_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *write_fn,
                                                    &s_spi_write_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *read_fn,
                                                    &s_spi_read_driver);
    if (!result && !JS_IsException(*object)) {
        JS_ThrowInternalError(ctx, "failed to register SPI Future drivers");
    }
    JS_PopGCRef(ctx, &read_ref);
    JS_PopGCRef(ctx, &write_ref);
    JS_PopGCRef(ctx, &transfer_ref);
    JS_PopGCRef(ctx, &object_ref);
    return result;
}

JSValue js_spi_device_transfer(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return spi_future_call_and_wait(ctx, *this_val, "transfer", argc, argv);
}

JSValue js_spi_device_write(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return spi_future_call_and_wait(ctx, *this_val, "write", argc, argv);
}

JSValue js_spi_device_write_chunks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_device_ref_t device_ref;
    esp32_mquickjs_spi_device_slot_t *device_slot = NULL;
    esp32_mquickjs_spi_bus_slot_t *bus_slot = NULL;
    spi_write_chunks_options_t options;
    spi_transaction_t transactions[2];
    esp32_mquickjs_byte_source_chunk_t active_chunks[2];
    bool active_direct[2] = {false, false};
    uint32_t chunk_count = 0;
    uint32_t queue_head = 0;
    uint32_t queue_tail = 0;
    uint32_t in_flight = 0;
    uint32_t max_in_flight;
    uint32_t queued_chunks = 0;
    uint32_t index;
    size_t bytes = 0;
    uint64_t prep_us = 0;
    uint64_t queue_us = 0;
    uint64_t wait_us = 0;
    uint64_t total_us;
    int64_t total_start;
    bool direct = true;
    JSValue error = JS_UNDEFINED;
    esp_err_t err = ESP_OK;

