99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
    memset(transactions, 0, sizeof(transactions));
    memset(active_chunks, 0, sizeof(active_chunks));

    if (spi_get_this_device_slots(ctx,
                                  *this_val,
                                  "SPIDevice.writeChunks()",
                                  &device_ref,
                                  &device_slot,
                                  &bus_slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1 ||
        !esp32_mquickjs_get_byte_source_array_length(ctx,
                                                     argv[0],
                                                     "SPIDevice.writeChunks(chunks)",
                                                     &chunk_count,
                                                     &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "SPIDevice.writeChunks(chunks) expects an array-like object")
                   : error;
    }
    if (!spi_parse_write_chunks_options(ctx,
                                        argc >= 2 ? argv[1] : JS_UNDEFINED,
                                        "SPIDevice.writeChunks()",
                                        &options)) {
        return JS_EXCEPTION;
    }
    max_in_flight = spi_clamp_queue_depth(device_slot, options.queue_depth);
    total_start = esp_timer_get_time();

    for (index = 0; index < chunk_count; ++index) {
        esp32_mquickjs_byte_source_chunk_t *chunk;
        size_t chunk_length;
        uint32_t slot_index;
        int64_t step_start;

        while (in_flight >= max_in_flight) {
            err = spi_wait_queued_write(device_slot->handle, &wait_us);
            if (active_direct[queue_head]) {
                esp32_mquickjs_release_byte_source_chunk(ctx, &active_chunks[queue_head]);
                active_direct[queue_head] = false;
            }
            if (err != ESP_OK) {
                goto fail;
            }
            queue_head = (queue_head + 1U) % max_in_flight;
            in_flight--;
        }

        slot_index = queue_tail;
        chunk = &active_chunks[slot_index];
        if (!esp32_mquickjs_get_byte_source_chunk(ctx,
                                                  argv[0],
                                                  index,
                                                  "SPIDevice.writeChunks(chunks)",
                                                  chunk,
                                                  &error)) {
            if (!JS_IsUndefined(error)) {
                goto fail_with_js_error;
            }
            error = JS_ThrowTypeError(ctx, "SPIDevice.writeChunks(chunks) expects byte-source chunks");
            goto fail_with_js_error;
        }
        chunk_length = chunk->source.length;
        if (chunk_length == 0) {
            esp32_mquickjs_release_byte_source_chunk(ctx, chunk);
            continue;
        }
        if (chunk_length > bus_slot->max_transfer_size) {
            esp32_mquickjs_release_byte_source_chunk(ctx, chunk);
            error = JS_ThrowRangeError(ctx,
                                       "SPIDevice.writeChunks() chunk length (%u) exceeds SPIBus maxTransferSize (%u)",
                                       (unsigned)chunk_length,
                                       (unsigned)bus_slot->max_transfer_size);
            goto fail_with_js_error;
        }

        memset(&transactions[slot_index], 0, sizeof(transactions[slot_index]));
        transactions[slot_index].length = chunk_length * 8U;
        if (spi_byte_source_can_dma(&chunk->source)) {
            transactions[slot_index].tx_buffer = chunk->source.data;
            active_direct[slot_index] = true;
        } else {
            step_start = esp_timer_get_time();
            if (!spi_ensure_tx_dma_buffer(device_slot, slot_index, chunk_length)) {
                esp32_mquickjs_release_byte_source_chunk(ctx, chunk);
                error = JS_ThrowOutOfMemory(ctx);
                goto fail_with_js_error;
            }
            memcpy(device_slot->tx_dma_buffers[slot_index], chunk->source.data, chunk_length);
            prep_us += (uint64_t)(esp_timer_get_time() - step_start);
            transactions[slot_index].tx_buffer = device_slot->tx_dma_buffers[slot_index];
            esp32_mquickjs_release_byte_source_chunk(ctx, chunk);
            active_direct[slot_index] = false;
            direct = false;
        }

        step_start = esp_timer_get_time();
        err = spi_queue_transaction_cooperatively(device_slot->handle, &transactions[slot_index]);
        queue_us += (uint64_t)(esp_timer_get_time() - step_start);
        if (err != ESP_OK) {
            if (active_direct[slot_index]) {
                esp32_mquickjs_release_byte_source_chunk(ctx, &active_chunks[slot_index]);
                active_direct[slot_index] = false;
            }
            goto fail;
        }

        queue_tail = (queue_tail + 1U) % max_in_flight;
        in_flight++;
        queued_chunks++;
        bytes += chunk_length;
    }

    while (in_flight > 0) {
        err = spi_wait_queued_write(device_slot->handle, &wait_us);
        if (active_direct[queue_head]) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &active_chunks[queue_head]);
            active_direct[queue_head] = false;
        }
        if (err != ESP_OK) {
            goto fail;
        }
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }

    total_us = (uint64_t)(esp_timer_get_time() - total_start);
    return spi_make_write_chunks_stats(ctx,
                                       queued_chunks,
                                       bytes,
                                       prep_us,
                                       queue_us,
                                       wait_us,
                                       total_us,
                                       max_in_flight,
                                       direct);

fail_with_js_error:
    while (in_flight > 0) {
        (void)spi_wait_queued_write(device_slot->handle, &wait_us);
        if (active_direct[queue_head]) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &active_chunks[queue_head]);
            active_direct[queue_head] = false;
        }
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }
    return error;

