99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/spi/esp32_mquickjs_spi.c
fail:
    while (in_flight > 0) {
        esp_err_t wait_err = spi_wait_queued_write(device_slot->handle, &wait_us);

        if (active_direct[queue_head]) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &active_chunks[queue_head]);
            active_direct[queue_head] = false;
        }
        if (err == ESP_OK) {
            err = wait_err;
        }
        queue_head = (queue_head + 1U) % max_in_flight;
        in_flight--;
    }
    return spi_throw_error(ctx, err, "SPIDevice.writeChunks() failed");
}

JSValue js_spi_device_write_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_spi_device_ref_t device_ref;
    esp32_mquickjs_spi_device_slot_t *device_slot = NULL;
    esp32_mquickjs_spi_bus_slot_t *bus_slot = NULL;
    spi_write_chunks_options_t options;
    esp32_mquickjs_byte_span_source_t source;
    JSValue error = JS_UNDEFINED;
    JSGCRef result_ref;
    JSValue *result;

    memset(&source, 0, sizeof(source));

    if (spi_get_this_device_slots(ctx,
                                  *this_val,
                                  "SPIDevice.writeSource()",
                                  &device_ref,
                                  &device_slot,
                                  &bus_slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1 ||
        !esp32_mquickjs_open_byte_span_source(ctx,
                                             argv[0],
                                             "SPIDevice.writeSource(source)",
                                             &source,
                                             &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "SPIDevice.writeSource(source) expects a ByteSpanSource")
                   : error;
    }
    if (!spi_parse_write_chunks_options(ctx,
                                        argc >= 2 ? argv[1] : JS_UNDEFINED,
                                        "SPIDevice.writeSource()",
                                        &options)) {
        esp32_mquickjs_byte_span_source_close(ctx, &source);
        return JS_EXCEPTION;
    }

    result = JS_PushGCRef(ctx, &result_ref);
    *result = spi_write_span_source(ctx,
                                    bus_slot,
                                    device_slot,
                                    &source,
                                    &options,
                                    "SPIDevice.writeSource()");
    esp32_mquickjs_byte_span_source_close(ctx, &source);
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_spi_device_read(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return spi_future_call_and_wait(ctx, *this_val, "read", argc, argv);
}

JSValue js_spi_open_bus(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return spi_open_bus(ctx, argc, argv);
}

JSValue js_spi_get_host_2(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, 2);
}

JSValue js_spi_get_host_3(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, 3);
}

JSValue js_spi_get_default_host(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_HOST_NUMBER);
}

JSValue js_spi_get_default_sclk(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_SCLK_PIN);
}

JSValue js_spi_get_default_mosi(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_MOSI_PIN);
}

JSValue js_spi_get_default_miso(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_MISO_PIN);
}

JSValue js_spi_get_default_cs(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_CS_PIN);
}

JSValue js_spi_get_default_freq_hz(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_FREQ_HZ);
}

JSValue js_spi_get_default_queue_size(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_QUEUE_SIZE);
}

JSValue js_spi_get_default_max_transfer_size(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_SPI_DEFAULT_MAX_TRANSFER_SIZE);
}

#endif
